Revit 2027 API
FailureDefinitionAccessor.GetResolutionCaption Method
 Retrieves the caption for a specific resolution type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetResolutionCaption(
	FailureResolutionType type
)
Public Function GetResolutionCaption (
	type As FailureResolutionType
) As String
public:
String^ GetResolutionCaption(
	FailureResolutionType type
)
member GetResolutionCaption :
        type : FailureResolutionType -> string
Parameters
type FailureResolutionType
 The resolution type.
Return Value
String
 The caption of the resolution.
Exceptions
Exception | Condition
ArgumentException |  Resolution of the type is not applicable to the failure.
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  The FailureDefinitionAccessor has not been properly initialized. -or- FailureDefinition does not have any resolutions.
See Also
Reference
FailureDefinitionAccessor Class
Autodesk.Revit.DB Namespace